In [1]:
import pandas as pd
import numpy as np

In [ ]:
# limpeza de dados - isna, notna, duplicated

In [2]:
df = pd.DataFrame({
'ord_no':[70001,70006,70002,70004,70007,70005,70008,70010,70003,70011,70009,70012],
'purch_amt':[150.5,270.65,65.26,110.5,948.5,2400.6,5760,1983.43,2480.4,250.45, 75.29,3045.6],
'ord_date': ['2012-10-05','2012-09-10',np.nan,'2012-08-17','2012-09-10','2012-07-27','2012-09-10','2012-10-10','2012-10-10','2012-06-27','2012-08-17','2012-04-25'],
'customer_id':[3002,3001,3001,3003,3002,3001,3001,3004,3003,3002,3001,3001],
'salesman_id':[5002,5003,5001,np.nan,5002,5001,5001,np.nan,5003,5002,5003,np.nan]})

In [3]:
df

    ord_no  purch_amt    ord_date  customer_id  salesman_id
0    70001     150.50  2012-10-05         3002       5002.0
1    70006     270.65  2012-09-10         3001       5003.0
2    70002      65.26         NaN         3001       5001.0
3    70004     110.50  2012-08-17         3003          NaN
4    70007     948.50  2012-09-10         3002       5002.0
5    70005    2400.60  2012-07-27         3001       5001.0
6    70008    5760.00  2012-09-10         3001       5001.0
7    70010    1983.43  2012-10-10         3004          NaN
8    70003    2480.40  2012-10-10         3003       5003.0
9    70011     250.45  2012-06-27         3002       5002.0
10   70009      75.29  2012-08-17         3001       5003.0
11   70012    3045.60  2012-04-25         3001          NaN

In [4]:
# isna mostra uma copia do dataframe com a resposta booleana 
df.isna()

    ord_no  purch_amt  ord_date  customer_id  salesman_id
0    False      False     False        False        False
1    False      False     False        False        False
2    False      False      True        False        False
3    False      False     False        False         True
4    False      False     False        False        False
5    False      False     False        False        False
6    False      False     False        False        False
7    False      False     False        False         True
8    False      False     False        False        False
9    False      False     False        False        False
10   False      False     False        False        False
11   False      False     False        False         True

In [ ]:
# isna.any mostra uma Series com a resposta booleana agregada da coluna (se tiver ao menos um valor nan ele retorna True)
df.isna().any()
# isna.all mostra uma Series com a resposta booleana agregada da coluna (ele só retorna True se todos os valores forem NaN)
df.isna().all()
df['nan_test'] = None
df.isna().all()
# isna.sum() mostra uma Series com a conta de quantos valores NaN temos em cada coluna do Dataframe
print(df.isna().sum())
# sum duas veces traz o valor total do dataframe
df.isna().sum().sum()

In [ ]:
#Criamos uma coluna com valores teste, atenção na diferencia entre None e np.nan, também se a nossa serie é menor veja o que acontece
df['othervalue_test'] = pd.Series([12,9,None,'--','*',9,np.nan,100,'--'])
df

In [ ]:
df.info()

In [ ]:
#notna - Mostra uma Series com a conta contraria do isna
df.notna().sum()

In [ ]:
#replace conseguimos trocar todos os valores do nosso dataframe, utilizando o formato de dict
df_replaced = df.replace({"*": np.nan, "--": np.nan, None:np.nan})
df_replaced

In [ ]:
#Observe como a nossa coluna se transformou em dtype float
df_replaced.info()

OBSERVAÇÃO
>**None** - é um Python type que não deve ser usado matematicamente ele vale mais como um valor não existente ou vazio<br>
>**NaN** - é um valor que é utilizado para representar um valor numericamente invalido ele é considerado como float

In [ ]:
df_replaced['customer_id']

In [ ]:
# duplicated - Mostra uma Series com a verificação se tem valores duplicados
# subset - para escolher qual coluna
# keep - first=coloca True apos a primeira ocorrencia / last-coloca True desde a primeira aparição e False na ultma ocorrencia da serie
df_replaced.duplicated(subset=['customer_id'],keep='last')

In [ ]:
df_replaced

In [ ]:
# droping values - drop, dropna, drop_duplicates

In [ ]:
#drop - da um drop na coluna ou colunas especificada
df_replaced.drop(columns=['nan_test','othervalue_test'])

In [ ]:
#dropna - da um drop em colunas ou linhas, se não especificar dropa linha ou coluna se tiver ao menos um na value / default axis=0
df_replaced.dropna(axis=1)

In [ ]:
#drop_duplicates, T (Transpose) - Muda a orientação do Dataframe
df_temp = pd.DataFrame(df_replaced.iloc[9,:]).T
df_temp

In [ ]:
df_replaced = df_replaced.append(df_temp)
#falar do inplace (https://towardsdatascience.com/why-you-should-probably-never-use-pandas-inplace-true-9f9f211849e4#:~:text=Using%20the%20inplace%3DTrue%20keyword,which%20you%20apply%20it%20to.)
df_replaced = df_replaced.reset_index(drop=True)

In [ ]:
df_replaced

In [ ]:
#drop_duplicates - faz um drop em qualquer linha que tiver todos os valores iguais, subset escolhe coluna, keep(last ou first)
df_replaced.drop_duplicates(subset=['customer_id'],keep='first')

In [ ]:
df_replaced = df_replaced.drop_duplicates()

In [ ]:
df_replaced

In [ ]:
# manipulação de dataframes - merge, concat, melt

In [ ]:
#melt - transforma nosso dataframe para usos especificos id_vars escolhe qual é a nossa primera coluna e value_vars qual queremos mostrar
df_replaced.melt()

In [ ]:
df_replaced.melt(id_vars='ord_no',value_vars='purch_amt')

>**Merge** - junta dois dataframes e podemos especificar como:
- em coluna especifica
- left(so nos valores que tiverem na coluna esquerda)
- right(so nos valores que tiverem na coluna direita)
- inner(so nos valores em comum nos dois dataframes)
- outer(tudo)

In [ ]:
df_clientes = pd.read_csv('customers.csv',sep=';')

In [ ]:
df_clientes

In [ ]:
df_replaced.merge(df_clientes,how='left',on=['ord_no'])

In [ ]:
#DIY - Grupos (Olist)

https://www.kaggle.com/datasets/olistbr/brazilian-ecommerce

1. Pegar os dados de products, orders,  customers,items
2. Explorar os dados e identificar as colunas em comum
3. Junte as colunas no seu dataframe de items necessarias para poder ver quais são as 10 categorias que mais trouxeram receita pra a empresa
4. Faça um groupby e descobra qual order_id teve mais produtos pedidos(um pedido pode ter mais de um item)
    - Procure por esse pedido no df de clientes(faça o merge)
    - De qual estado é o cliente?
5. No DF de orders crie uma nova coluna com o time delta entre a data estimada de entrega e a data real 
6. Analise a coluna e traga conclusões(
    - temos valores outliers?
    - quanto eles representam?
    - qual é a nossa media?
    - quanto representa nosso de nosso dataframe pedidos que demoraram mais de 5 dias para entregar apos a data prometida
7. Quantos estados temos no nosso dataset?, Tem todos os estados do Brasil?,Quais são os 3 estados com mais pedidos?
8. Bonus(Faça um gafico com essa informação)

In [3]:
import pandas as pd

In [6]:
# 1. Pegar os dados de products, orders,  customers,items
products = pd.read_csv('./bases_olist/olist_products_dataset.csv')
orders = pd.read_csv('./bases_olist/olist_orders_dataset.csv')
customers = pd.read_csv('./bases_olist/olist_customers_dataset.csv')
items = pd.read_csv('./bases_olist/olist_order_items_dataset.csv')

In [7]:
# 2. Explorar os dados e identificar as colunas em comum
display(products.columns)
display(orders.columns)
display(customers.columns)
display(items.columns)

Index(['product_id', 'product_category_name', 'product_name_lenght',
       'product_description_lenght', 'product_photos_qty', 'product_weight_g',
       'product_length_cm', 'product_height_cm', 'product_width_cm'],
      dtype='object')

Index(['order_id', 'customer_id', 'order_status', 'order_purchase_timestamp',
       'order_approved_at', 'order_delivered_carrier_date',
       'order_delivered_customer_date', 'order_estimated_delivery_date'],
      dtype='object')

Index(['customer_id', 'customer_unique_id', 'customer_zip_code_prefix',
       'customer_city', 'customer_state'],
      dtype='object')

Index(['order_id', 'order_item_id', 'product_id', 'seller_id',
       'shipping_limit_date', 'price', 'freight_value'],
      dtype='object')

In [13]:
print('products')
display(products.head())
print('orders')
display(orders.head())
print('customers')
display(customers.head())
print('items')
display(items.head())

products

,product_id,product_category_name,product_name_lenght,product_description_lenght,product_photos_qty,product_weight_g,product_length_cm,product_height_cm,product_width_cm
0,1e9e8ef04dbcff4541ed26657ea517e5,perfumaria,40.0,287.0,1.0,225.0,16.0,10.0,14.0
1,3aa071139cb16b67ca9e5dea641aaa2f,artes,44.0,276.0,1.0,1000.0,30.0,18.0,20.0
2,96bd76ec8810374ed1b65e291975717f,esporte_lazer,46.0,250.0,1.0,154.0,18.0,9.0,15.0
3,cef67bcfe19066a932b7673e239eb23d,bebes,27.0,261.0,1.0,371.0,26.0,4.0,26.0
4,9dc1a7de274444849c219cff195d0b71,utilidades_domesticas,37.0,402.0,4.0,625.0,20.0,17.0,13.0

orders

,order_id,customer_id,order_status,order_purchase_timestamp,order_approved_at,order_delivered_carrier_date,order_delivered_customer_date,order_estimated_delivery_date
0,e481f51cbdc54678b7cc49136f2d6af7,9ef432eb6251297304e76186b10a928d,delivered,2017-10-02 10:56:33,2017-10-02 11:07:15,2017-10-04 19:55:00,2017-10-10 21:25:13,2017-10-18 00:00:00
1,53cdb2fc8bc7dce0b6741e2150273451,b0830fb4747a6c6d20dea0b8c802d7ef,delivered,2018-07-24 20:41:37,2018-07-26 03:24:27,2018-07-26 14:31:00,2018-08-07 15:27:45,2018-08-13 00:00:00
2,47770eb9100c2d0c44946d9cf07ec65d,41ce2a54c0b03bf3443c3d931a367089,delivered,2018-08-08 08:38:49,2018-08-08 08:55:23,2018-08-08 13:50:00,2018-08-17 18:06:29,2018-09-04 00:00:00
3,949d5b44dbf5de918fe9c16f97b45f8a,f88197465ea7920adcdbec7375364d82,delivered,2017-11-18 19:28:06,2017-11-18 19:45:59,2017-11-22 13:39:59,2017-12-02 00:28:42,2017-12-15 00:00:00
4,ad21c59c0840e6cb83a9ceb5573f8159,8ab97904e6daea8866dbdbc4fb7aad2c,delivered,2018-02-13 21:18:39,2018-02-13 22:20:29,2018-02-14 19:46:34,2018-02-16 18:17:02,2018-02-26 00:00:00

customers

,customer_id,customer_unique_id,customer_zip_code_prefix,customer_city,customer_state
0,06b8999e2fba1a1fbc88172c00ba8bc7,861eff4711a542e4b93843c6dd7febb0,14409,franca,SP
1,18955e83d337fd6b2def6b18a428ac77,290c77bc529b7ac935b93aa66c333dc3,9790,sao bernardo do campo,SP
2,4e7b3e00288586ebd08712fdd0374a03,060e732b5b29e8181a18229c7b0b2b5e,1151,sao paulo,SP
3,b2b6027bc5c5109e529d4dc6358b12c3,259dac757896d24d7702b9acbbff3f3c,8775,mogi das cruzes,SP
4,4f2d8ab171c80ec8364f7c12e35b23ad,345ecd01c38d18a9036ed96c73b8d066,13056,campinas,SP

items

,order_id,order_item_id,product_id,seller_id,shipping_limit_date,price,freight_value
0,00010242fe8c5a6d1ba2dd792cb16214,1,4244733e06e7ecb4970a6e2683c13e61,48436dade18ac8b2bce089ec2a041202,2017-09-19 09:45:35,58.90,13.29
1,00018f77f2f0320c557190d7a144bdd3,1,e5f2d52b802189ee658865ca93d83a8f,dd7ddc04e1b6c2c614352b383efe2d36,2017-05-03 11:05:13,239.90,19.93
2,000229ec398224ef6ca0657da4fc703e,1,c777355d18b72b67abbeef9df44fd0fd,5b51032eddd242adc84c38acab88f23d,2018-01-18 14:48:30,199.00,17.87
3,00024acbcdf0a6daa1e931b038114c75,1,7634da152a4610f1595efa32f14722fc,9d7a1d34a5052409006425275ba1c2b4,2018-08-15 10:10:18,12.99,12.79
4,00042b26cf59d7ce69dfabb4e55b4fd9,1,ac6c3623068f30de03045865e4e10089,df560393f3a51e74553ab94004ba5c87,2017-02-13 13:57:51,199.90,18.14

In [24]:
display(items.order_item_id.max())

21

In [33]:
more_prod_ord = items[items.order_item_id == items.order_item_id.max()]['order_id'].iloc[0]
more_prod_ord

'8272b63d03f5f79c56e9e4120aec44ef'

In [36]:
cust_more_prod = orders[orders.order_id == more_prod_ord]['customer_id'].iloc[0]
cust_more_prod

'fc3d1daec319d62d49bfb5e1f83123e9'

In [38]:
cust_est = customers[customers.customer_id == cust_more_prod]['customer_city'].iloc[0]
cust_est

'sao paulo'

In [ ]:
# 3. Junte as colunas no seu dataframe de items necessarias para poder ver quais são as 10 categorias que mais trouxeram receita pra a empresa
products[['product_id','product_category_name', '']]
orders[['order_id',]]
items[['product_id', 'price']]

In [22]:
un_prod = items.groupby('order_id').product_id.unique().reset_index()

In [ ]:
un_prod.product_id.

In [ ]:
lista_geral = [products.columns, orders.columns, customers.columns, items.columns]

1. Pegar os dados de products, orders,  customers,items
2. Explorar os dados e identificar as colunas em comum
3. Junte as colunas no seu dataframe de items necessarias para poder ver quais são as 10 categorias que mais trouxeram receita pra a empresa
4. Faça um groupby e descobra qual order_id teve mais produtos pedidos(um pedido pode ter mais de um item)
    - Procure por esse pedido no df de clientes(faça o merge)
    - De qual estado é o cliente?
5. No DF de orders crie uma nova coluna com o time delta entre a data estimada de entrega e a data real 
6. Analise a coluna e traga conclusões(
    - temos valores outliers?
    - quanto eles representam?
    - qual é a nossa media?
    - quanto representa nosso de nosso dataframe pedidos que demoraram mais de 5 dias para entregar apos a data prometida
7. Quantos estados temos no nosso dataset?, Tem todos os estados do Brasil?,Quais são os 3 estados com mais pedidos?
8. Bonus(Faça um gafico com essa informação)

In [10]:
notas_alunos = pd.DataFrame({'aluno': list('ABCD'),
                'prova1': [8,8,7,6],
                'prova2':[6,5,5,7],
                'prova3':[9,4,2,3]})

display(notas_alunos)

  aluno  prova1  prova2  prova3
0     A       8       6       9
1     B       8       5       4
2     C       7       5       2
3     D       6       7       3

In [12]:
melted = notas_alunos.melt(id_vars='aluno', value_vars=['prova1','prova2','prova3'])
melted

   aluno variable  value
0      A   prova1      8
1      B   prova1      8
2      C   prova1      7
3      D   prova1      6
4      A   prova2      6
5      B   prova2      5
6      C   prova2      5
7      D   prova2      7
8      A   prova3      9
9      B   prova3      4
10     C   prova3      2
11     D   prova3      3